ГТС/УТГТС/DataProcessors/ПечатьТранспортнойНакладной.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПечатьТранспортнойНакладной</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

ГТС/УТГТС/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицоНеРезидент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МногооборотнаяТара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Documents/ТранспортнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТранспортнаяНакладная</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтомобильВместимостьВКубическихМетрах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтомобильГосударственныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтомобильГрузоподъемностьВТоннах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтомобильМарка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтомобильТип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставкиЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПогрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПогрузкиЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетЗаказчикаПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетПлательщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетПеревозчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводДанныхОТоварномСоставе</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВыводаДанныхОТоварномСоставе</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосударственныйНомерПрицепа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенностьВыдана</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенностьДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенностьЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоверенностьНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданиеНаПеревозку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказчикПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицензионнаяКарточкаВид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицензионнаяКарточкаНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицензионнаяКарточкаРегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицензионнаяКарточкаСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МассаНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отпустил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтпустилДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдостоверениеНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдостоверениеСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеревозчикПартнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставкиЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставкиПеревозчикаЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПогрузкиЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ASP_Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВодителиГТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтгрузкаТоваровСХранения</v8:Type>
								<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПередачаТоваровХранителю</v8:Type>
								<v8:Type>cfg:DocumentRef.ОтгрузкаТоваровКлиенту</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ГТС/УТГТС/DataProcessors/ПечатьТранспортнойНакладной/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Печать

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ТранспортнаяНакладная") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
						КоллекцияПечатныхФорм,
						"ТранспортнаяНакладная", НСтр("ru = 'Транспортная накладная'"),
						СформироватьПечатнуюФормуТранспортнойНакладной(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

Функция СформироватьПечатнуюФормуТранспортнойНакладной(МассивОбъектов, ОбъектыПечати, КомплектыПечати = Неопределено) Экспорт
	
	ТипДокументов = ТипЗнч(МассивОбъектов[0]);

	Если ТипДокументов <> Тип("ДокументСсылка.ТранспортнаяНакладная") Тогда 
		
		СтруктураВозврата = УправлениеПечатьюУТВызовСервераЛокализация.ПолучитьТранспортныеНакладныеНаПечать(МассивОбъектов);
		ТранспортныеНакладныеНаПечать = СтруктураВозврата.ТранспортныеНакладныеНаПечать;
		
		Для Каждого Документ Из СтруктураВозврата.МассивДокументовБезНакладных Цикл
			
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Для документа %1 не создана ""Транспортная накладная"". Печать документа ""Транспортная накладная"" невозможна.'"),
					Документ);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					Текст,
					Документ)
					
		КонецЦикла	
			
	Иначе
		ТранспортныеНакладныеНаПечать = МассивОбъектов;	
	КонецЕсли;
	
	ТаблицаНакладныхНаПечать = Новый ТаблицаЗначений;
	ОписаниеТипаТранспортнаяНакладная = Новый ОписаниеТипов("ДокументСсылка.ТранспортнаяНакладная");
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число");
	ТаблицаНакладныхНаПечать.Колонки.Добавить("ТранспортнаяНакладная", ОписаниеТипаТранспортнаяНакладная);
	ТаблицаНакладныхНаПечать.Колонки.Добавить("ПорядковыйНомер", ОписаниеТипаЧисло);
	
	ПорядковыйНомер = 0;
	Для Каждого Накладная Из ТранспортныеНакладныеНаПечать Цикл 
		СтрокаТаблицы = ТаблицаНакладныхНаПечать.Добавить();	
		СтрокаТаблицы.ТранспортнаяНакладная = Накладная;
		СтрокаТаблицы.ПорядковыйНомер = ПорядковыйНомер;
		ПорядковыйНомер = ПорядковыйНомер  + 1;
	КонецЦикла;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ТРАНСПОРТНАЯ_НАКЛАДНАЯ";
		
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Документ.ТранспортнаяНакладная");
	ДанныеДляПечати = МенеджерОбъекта.ПолучитьДанныеДляПечатнойФормыТранспортнаяНакладная(ТаблицаНакладныхНаПечать);
		
	ЗаполнитьТабличныйДокументТН(
			ТабличныйДокумент,
			ДанныеДляПечати,
			ОбъектыПечати,
			КомплектыПечати);

	Возврат ТабличныйДокумент;
	
КонецФункции

Процедура ЗаполнитьТабличныйДокументТН(ТабличныйДокумент, СтруктураДанных, ОбъектыПечати, КомплектыПечати)
	
	Макет1529 = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьТранспортнойНакладной.ПФ_MXL_ТранспортнаяНакладная_ru");
	Макет2200 = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьТранспортнойНакладной.ПФ_MXL_ТранспортнаяНакладная_2200_ru");
	Макет2200_1 = УправлениеПечатью.МакетПечатнойФормы("Обработка.ПечатьТранспортнойНакладной.ПФ_MXL_ТранспортнаяНакладная_2200_1_ru");
	
	Макет1529.КодЯзыка = Метаданные.Языки.Русский.КодЯзыка;
	Макет2200.КодЯзыка = Метаданные.Языки.Русский.КодЯзыка;
	Макет2200_1.КодЯзыка = Метаданные.Языки.Русский.КодЯзыка;
	
	ТаблицаДанныхДляПечати = СтруктураДанных.ТаблицаРезультата;
	ДанныеСсылкиДокументов = СтруктураДанных.РезультатИменаТоваров.Выбрать();
		
	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеПечати Из ТаблицаДанныхДляПечати Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
			
		ПервыйДокумент    = Ложь;

		// Если ТТН с доставкой и нашли связанные с доставкой ошибки - перейдем к следующему документу.
		СтруктураЗаданиеНаПеревозку = Новый Структура("НеНайденоЗаданиеНаПеревозку,
													  |БолееОдногоВхожденияВЗаданияНаПеревозку,
													  |РаспоряжениеНеПроведено",
													  Ложь,Ложь,Ложь);
		ЕстьОшибкиДоставки = Ложь;
		ЗаполнитьЗначенияСвойств(СтруктураЗаданиеНаПеревозку,ДанныеПечати);
		
		Если СтруктураЗаданиеНаПеревозку.НеНайденоЗаданиеНаПеревозку Тогда
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Для документа %1 не найдено задание на перевозку. 
					|Печать формы 1-Т для документов с доставкой возможна после включения документа в задание на перевозку.'"),
				ДанныеПечати.Ссылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ДанныеПечати.Ссылка);
			ЕстьОшибкиДоставки = Истина;
		КонецЕсли;
		
		Если СтруктураЗаданиеНаПеревозку.БолееОдногоВхожденияВЗаданияНаПеревозку Тогда
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Невозможно напечатать форму 1-Т для %1, т.к. найдено более одного задания на перевозку, 
					|в которые включен этот документ.'"),
				ДанныеПечати.Ссылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ДанныеПечати.Ссылка);
			ЕстьОшибкиДоставки = Истина;
		КонецЕсли;
		
		Если СтруктураЗаданиеНаПеревозку.РаспоряжениеНеПроведено Тогда
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Документ %1 не проведен. Печать товарно - транспортной накладной не будет выполнена.'"),
				ДанныеПечати.Ссылка);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ДанныеПечати.Ссылка);
			ЕстьОшибкиДоставки = Истина;
		КонецЕсли;
		
		Если ЕстьОшибкиДоставки Тогда
			Продолжить;
		КонецЕсли;
		
		Если ДанныеПечати.ЕстьНепроведенныеДокументыОснования Тогда
			
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'В документе %1 присутствуют непроведенные документы-основания. Печать транспортной накладной невозможна.'"),
				ДанныеПечати.Ссылка);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ДанныеПечати.Ссылка);
				
			Продолжить;
			
		КонецЕсли;
				
		Если ДанныеПечати.Дата < '20210101' Тогда
			ЗаполнитьТабличныйДокументТНВерсияДо2022(ТабличныйДокумент, ОбъектыПечати, ДанныеСсылкиДокументов, ДанныеПечати, Макет1529);
		ИначеЕсли ДанныеПечати.Дата < '20220301' Тогда
			ЗаполнитьТабличныйДокументТНВерсияДо2022(ТабличныйДокумент, ОбъектыПечати, ДанныеСсылкиДокументов, ДанныеПечати, Макет2200);
		Иначе
			ЗаполнитьТабличныйДокументТНВерсияС2022(ТабличныйДокумент, ОбъектыПечати, ДанныеСсылкиДокументов, ДанныеПечати, Макет2200_1);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


Процедура ЗаполнитьТабличныйДокументТНВерсияДо2022(ТабличныйДокумент, ОбъектыПечати, ДанныеСсылкиДокументов, ДанныеПечати, Макет)
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ОбластьМакета = Макет.ПолучитьОбласть("ГоризонтальнаяЛицеваяСторона");
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, ДанныеПечати.Ссылка);
		
		ОбластьМакетаОборотная = Макет.ПолучитьОбласть("ГоризонтальнаяОборотнаяСторона");
		
		СведенияОГрузополучателе  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузополучатель,  ДанныеПечати.Дата);
		СведенияОГрузоотправитель = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузоотправитель, ДанныеПечати.Дата);
		СведенияОПеревозчике      = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Перевозчик, ДанныеПечати.Дата);
		СведенияОВодителе         = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Водитель, ДанныеПечати.Дата);
		
		ПредставлениеГрузоотправителя = "";
		ПредставлениеПеревозчика      = "";
		Перевозчик                    = "";
		Грузоотправитель              = "";
		
		РеквизитыМакета = Новый Структура;
		РеквизитыМакета.Вставить("Пункт0_4", ДанныеПечати.Дата);
		РеквизитыМакета.Вставить("Пункт0_5", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер));
		
		Если ЗначениеЗаполнено(ДанныеПечати.Грузополучатель) Тогда 
			Если СведенияОГрузополучателе.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
				Или СведенияОГрузополучателе.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
				РеквизитыМакета.Вставить("Пункт2_1", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
					"ПолноеНаименование,ИНН,ЮридическийАдрес"));
			Иначе
				РеквизитыМакета.Вставить("Пункт2_2", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
					"ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны"));
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеПечати.Грузоотправитель) Тогда 
			Если СведенияОГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
			 Или СведенияОГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
				ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
					"ПолноеНаименование,ИНН,ЮридическийАдрес");
				РеквизитыМакета.Вставить("Пункт1_1", ПредставлениеГрузоотправителя);
				Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
			Иначе
				ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
					"ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны");
				РеквизитыМакета.Вставить("Пункт1_2", ПредставлениеГрузоотправителя);
				Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
			КонецЕсли;
		КонецЕсли;

		// Альтер ЛОГО+:	добавляем заполнение полей
		ДокОснНомер = "";
		ДокОснДата = "";
		Попытка
			ДокОсн = ДанныеПечати.Ссылка.ДокументыОснования[0].ДокументОснование;
			РеквизитОтветственный = РеквизитОтветственного(ДокОсн);
			ДокОснНомер = ?(Лев(ДокОсн.Номер, 3)= "ГТ-", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДокОсн.Номер, Истина, Истина), ДокОсн.Номер);
			ДокОснДата = ДокОсн.Дата;
		Исключение
			ДокОснНомер = ?(Лев(ДанныеПечати.Номер, 3)= "ГТ-", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер, Истина, Истина), ДанныеПечати.Номер);
			ДокОснДата = ДанныеПечати.Дата;
		КонецПопытки;
		ОбластьМакета.Параметры.Пункт0_2 = Формат(ДокОснДата, "ДЛФ=D");
		
		//ASP КАВ начало
		//ОбластьМакета.Параметры.Пункт0_3 = ДанныеПечати.Номер;
		ОбластьМакета.Параметры.Пункт0_3 = ДокОснНомер;
		//ASP КАВ конец
		СтруктураПоиска = Новый Структура("ПорядковыйНомер", ДанныеПечати.ПорядковыйНомер);
		
		ИменаТоваров = "";
		Пока ДанныеСсылкиДокументов.НайтиСледующий(СтруктураПоиска) Цикл								
			ИменаТоваров = ИменаТоваров + ДанныеСсылкиДокументов.НаименованиеВидаНоменклатуры + ", ";
		КонецЦикла;			
		
		Если СтрДлина(ИменаТоваров) >= 2 Тогда
			ИменаТоваров = Лев(ИменаТоваров, СтрДлина(ИменаТоваров) - 2);
		КонецЕсли;
		
		РеквизитыМакета.Вставить("Пункт3_1", ИменаТоваров);
		//ASP_Dante 12/07/21 Задача 000011492 перенос доработок
		Если ДействуетПостановление2200(ДанныеПечати.Дата) Тогда
			РеквизитыМакета.Вставить("Пункт6_0", ПредставлениеГрузоотправителя);
		КонецЕсли;
		//ASP_Dante 12/07/21
		РеквизитыМакета.Вставить("Пункт6_1", ДанныеПечати.ПунктПогрузки);
		РеквизитыМакета.Вставить("Пункт7_1", ДанныеПечати.ПунктРазгрузки);
		
		МассаБруттоСтрока = НСтр("ru = '%МассаБрутто% кг'", Метаданные.Языки.Русский.КодЯзыка);
		МассаБруттоСтрока = СтрЗаменить(МассаБруттоСтрока, "%МассаБрутто%", ДанныеПечати.МассаБрутто);
		
		РеквизитыМакета.Вставить("Пункт6_5", МассаБруттоСтрока);
		//ASP+
		КолМ = 0;
		СумМ = 0;
		тзНом = Новый ТаблицаЗначений;
		тзНом.Колонки.Добавить("Группа");
		Попытка
			Для Каждого стрД Из ДанныеПечати.Ссылка.ДокументыОснования Цикл
				Для Каждого стрТ Из стрД.ДокументОснование.Товары Цикл
					Если стрТ.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
						КолМ = КолМ + стрТ.Количество;
						СумМ = СумМ + стрТ.Сумма;
						стрНов = тзНом.Добавить();
						стрНов.Группа = ПолучитьВерхнююГруппуНоменклатуры(стрТ.Номенклатура.Родитель);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		Исключение КонецПопытки;
		тзНом.Свернуть("Группа");
		Наименования = НаименованиеГрузов(тзНом.ВыгрузитьКолонку("Группа"));
		
		Текст = "";
		Попытка
			Если ТипЗнч(ДокОсн)= Тип("ДокументСсылка.ПеремещениеТоваров") тогда
				Текст = "Накладная перемещения №";
			Иначе
				Текст = "";
			КонецЕсли;
		Исключение КонецПопытки;
		
		Попытка
			СчетаФактуры = Документы.СчетФактураВыданный.СчетаФактурыПоОснованию(ДокОсн,,,Истина);
			ЕстьСчетаФактуры = СчетаФактуры.Количество() > 0;
		Исключение
			ЕстьСчетаФактуры = Ложь;
		КонецПопытки;
		СФ_Номер = "";
		Если ЕстьСчетаФактуры Тогда
			СФ_Номер = СчетаФактуры[0].Номер;
			СФ_Номер = ?(Лев(СФ_Номер, 3) = "ГТ-", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СФ_Номер, Истина, Истина), СФ_Номер);
			СФ_Дата =СчетаФактуры[0].Дата;
		КонецЕсли;
		
		Если ТипЗнч(ДокОсн)= Тип("ДокументСсылка.ПеремещениеТоваров") тогда
		Текст = Текст + ?(ПустаяСтрока(ДокОснНомер), "", ДокОснНомер+" от "+Формат(ДокОснДата, "ДЛФ=D"))+
			?(ПустаяСтрока(СФ_Номер), "", ", счет-фактура №"+СФ_Номер+" от "+Формат(СФ_Дата, "ДЛФ=D"));
		Иначе
		Текст = Текст + ?(ПустаяСтрока(СФ_Номер), "", "УПД №"+СФ_Номер+" от "+Формат(СФ_Дата, "ДЛФ=D"));
		КонецЕсли;
		
		
		РеквизитыМакета.Вставить("Пункт3_1", Наименования);
		
		РеквизитыМакета.Вставить("Пункт3_2", Формат(Окр(КолМ,2), "ЧН=0")+" погрузочных мест");
		РеквизитыМакета.Вставить("Пункт3_3", Формат(Окр(ДанныеПечати.МассаБрутто,2), "ЧН=0")+" кг.");
		
		РеквизитыМакета.Вставить("Пункт4_1", Текст);
		
		//** ASP Иудин Д.А.  #3271 04.04.2019
		//  заменил это:
		
		//РеквизитыМакета.Вставить("Пункт5_3", Формат(Окр(СумМ,2), "ЧДЦ=2; ЧН=0,00")+" ("+РаботаСКурсамиВалют.СформироватьСуммуПрописью(СумМ, Константы.ВалютаРегламентированногоУчета.Получить())+")");
		
		//  на это:
		
		ВалютаРегламентированогоУчета	= Константы.ВалютаРегламентированногоУчета.Получить();
				
		Если ВалютаРегламентированогоУчета <> ДанныеПечати.Валюта Тогда
			
			СумМ = РаботаСКурсамиВалют.ПересчитатьВВалюту(СумМ, ДанныеПечати.Валюта, ВалютаРегламентированогоУчета, ДанныеПечати.ДатаОснования);
		КонецЕсли;
		
		РеквизитыМакета.Вставить("Пункт5_3", Формат(Окр(СумМ,2), "ЧДЦ=2; ЧН=0,00")+" ("+РаботаСКурсамиВалют.СформироватьСуммуПрописью(СумМ, ВалютаРегламентированогоУчета)+")");			
		
		///ASP #3271
		
		РеквизитыМакета.Вставить("Пункт6_51", Формат(Окр(КолМ,2), "ЧН=0"));
		РеквизитыМакета.Вставить("Пункт7_5",  Формат(Окр(ДанныеПечати.МассаБрутто,2), "ЧН=0")+" кг.");
		РеквизитыМакета.Вставить("Пункт7_51", Формат(Окр(КолМ,2), "ЧН=0"));
		РеквизитыМакета.Вставить("Пункт6_6",  ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДокОсн[РеквизитОтветственный].ФизическоеЛицо));
			//***
		РеквизитыМакета.Вставить("Пункт6_2", Формат(ДокОснДата, "ДЛФ=D"));
		РеквизитыМакета.Вставить("Пункт6_3", Формат(ДокОснДата, "ДЛФ=D"));
		РеквизитыМакета.Вставить("Пункт7_2", Формат(ДокОснДата, "ДЛФ=D"));
		РеквизитыМакета.Вставить("Пункт7_3", Формат(ДокОснДата, "ДЛФ=D"));
		//ASP-
		ОбластьМакета.Параметры.Заполнить(РеквизитыМакета);
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		РеквизитыМакета.Очистить();
		
		Если ЗначениеЗаполнено(ДанныеПечати.Перевозчик) Тогда 
			Если СведенияОПеревозчике.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
			 Или СведенияОПеревозчике.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
				ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
					"ПолноеНаименование,ФактическийАдрес,Телефоны");
				Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
				РеквизитыМакета.Вставить("Пункт10_1", ПредставлениеПеревозчика);
			Иначе
				ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
					"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
				Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
				РеквизитыМакета.Вставить("Пункт10_2", ПредставлениеПеревозчика);
			КонецЕсли;
		КонецЕсли;
		
		ПредставлениеВодителя = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.Водитель, ДанныеПечати.Дата);
		
		РеквизитыМакета.Вставить("Пункт10_3", ПредставлениеВодителя);
		
		ГрузоподъемностьВТоннахАвтомобиля      = Формат(ДанныеПечати.ГрузоподъемностьВТоннахАвтомобиля,"");
		ВместимостьВКубическихМетрахАвтомобиля = Формат(ДанныеПечати.ВместимостьВКубическихМетрахАвтомобиля,"");
		
		ИнформацияОбАвтомобиле = ""
			+ ?(ПустаяСтрока(ДанныеПечати.ТипАвтомобиля),"",Строка(ДанныеПечати.ТипАвтомобиля) + ", ")
			+ ?(ПустаяСтрока(ДанныеПечати.МаркаАвтомобиля),"",ДанныеПечати.МаркаАвтомобиля  + ", ")
			+ ?(ПустаяСтрока(ГрузоподъемностьВТоннахАвтомобиля),"",ГрузоподъемностьВТоннахАвтомобиля + " " + НСтр("ru = 'т'", Метаданные.Языки.Русский.КодЯзыка)  + ", ")
			+ ?(ПустаяСтрока(ВместимостьВКубическихМетрахАвтомобиля),"",ВместимостьВКубическихМетрахАвтомобиля + " " + НСтр("ru = 'куб. м'", Метаданные.Языки.Русский.КодЯзыка));
		
		ИнформацияОбАвтомобиле = СокрЛП(ИнформацияОбАвтомобиле);
		
		Пока Прав(ИнформацияОбАвтомобиле,1) = "," Цикл
			ИнформацияОбАвтомобиле = Лев(ИнформацияОбАвтомобиле, СтрДлина(ИнформацияОбАвтомобиле)-1)
		КонецЦикла;
		
		ОтветственноеЛицо = СтрШаблон(НСтр("ru = '%1 %2'"), ДанныеПечати.ДолжностьКладовщика, ДанныеПечати.Кладовщик);

		РеквизитыМакета.Вставить("Пункт11_1", ИнформацияОбАвтомобиле);
		РеквизитыМакета.Вставить("Пункт11_2", ДанныеПечати.ГосНомерАвтомобиля);
		
		СведенияОПлательщике = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Плательщик, ДанныеПечати.Дата,,ДанныеПечати.БанковскийСчетПлательщика);

		//ГТС 06.04.2021 Меняем на грузоотправителя
		//РеквизитыМакета.Вставить("Пункт15_6", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОЗаказчикеПеревозок, 
		//	"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет"));
		РеквизитыМакета.Вставить("Пункт15_6", ПредставлениеГрузоотправителя);
		
		//РеквизитыМакета.Вставить("Пункт16_1", Грузоотправитель);
		РеквизитыМакета.Вставить("Пункт16_1",  ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДокОсн[РеквизитОтветственный].ФизическоеЛицо));
		РеквизитыМакета.Вставить("Пункт16_2", Перевозчик);
		РеквизитыМакета.Вставить("Пункт16_3", ОтветственноеЛицо);
		
		РеквизитыМакета.Вставить("Пункт16_11", ДанныеПечати.Дата);
		РеквизитыМакета.Вставить("Пункт16_21", ДанныеПечати.Дата);
		
		ОбластьМакетаОборотная.Параметры.Заполнить(РеквизитыМакета);
		
		ТабличныйДокумент.Вывести(ОбластьМакетаОборотная);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
		// Альтер ЛОГО+:	подправим область печати
		//ТабличныйДокумент.ПолеСправа = 5;
		//ТабличныйДокумент.ПолеСлева = 5;
		//ТабличныйДокумент.ПолеСверху = 6;
		//ТабличныйДокумент.ПолеСнизу = 5;
		//ТабличныйДокумент.Автомасштаб = Истина;
		// +Альтер ЛОГО
	//КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТабличныйДокументТНВерсияС2022(ТабличныйДокумент, ОбъектыПечати, ДанныеСсылкиДокументов, ДанныеПечати, Макет)

	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	
	ОбластьМакета = Макет.ПолучитьОбласть("ГоризонтальнаяЛицеваяСторона");
	ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(ТабличныйДокумент, Макет, ОбластьМакета, ДанныеПечати.Ссылка);
	
	ОбластьМакетаОборотная = Макет.ПолучитьОбласть("ГоризонтальнаяОборотнаяСторона");
	
	СведенияОГрузополучателе  = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузополучатель,  ДанныеПечати.Дата);
	СведенияОГрузоотправитель = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Грузоотправитель, ДанныеПечати.Дата);
	СведенияОПеревозчике      = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Перевозчик, ДанныеПечати.Дата);
	
	ПредставлениеГрузоотправителя = "";
	ПредставлениеПеревозчика      = "";
	ПредставлениеПеревозчика12_6  = "";
	Грузоотправитель              = "";
	
	РеквизитыМакета = Новый Структура;
	РеквизитыМакета.Вставить("Пункт0_4", ДанныеПечати.Дата);
	РеквизитыМакета.Вставить("Пункт0_5", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер));
	
	Если ЗначениеЗаполнено(ДанныеПечати.Грузоотправитель) Тогда 
		Если СведенияОГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
		 Или СведенияОГрузоотправитель.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
				"ПолноеНаименование,ИНН,ЮридическийАдрес");
			РеквизитыМакета.Вставить("Пункт1_1", ПредставлениеГрузоотправителя);
			Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		Иначе
			ПредставлениеГрузоотправителя = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, 
				"ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны");
			РеквизитыМакета.Вставить("Пункт1_1", ПредставлениеГрузоотправителя);
			Грузоотправитель = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузоотправитель, "ПолноеНаименование");
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеПечати.Грузополучатель) Тогда 
		Если СведенияОГрузополучателе.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
			Или СведенияОГрузополучателе.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			РеквизитыМакета.Вставить("Пункт2_1", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
				"ПолноеНаименование,ИНН,ЮридическийАдрес"));
		Иначе
			РеквизитыМакета.Вставить("Пункт2_1", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, 
				"ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны"));
		КонецЕсли;
	КонецЕсли;
	РеквизитыМакета.Вставить("Пункт2_2", ДанныеПечати.ПунктРазгрузки);
	
	// Альтер ЛОГО+:	добавляем заполнение полей
		ДокОснНомер = "";
		ДокОснДата = "";
		Попытка
			ДокОсн = ДанныеПечати.Ссылка.ДокументыОснования[0].ДокументОснование;
			РеквизитОтветственный = РеквизитОтветственного(ДокОсн);
			ДокОснНомер = ?(Лев(ДокОсн.Номер, 3)= "ГТ-", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДокОсн.Номер, Истина, Истина), ДокОсн.Номер);
			ДокОснДата = ДокОсн.Дата;
		Исключение
			ДокОснНомер = ?(Лев(ДанныеПечати.Номер, 3)= "ГТ-", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеПечати.Номер, Истина, Истина), ДанныеПечати.Номер);
			ДокОснДата = ДанныеПечати.Дата;
		КонецПопытки;
		ОбластьМакета.Параметры.Пункт0_2 = Формат(ДокОснДата, "ДЛФ=D");
		
		//ASP КАВ начало
		//ОбластьМакета.Параметры.Пункт0_3 = ДанныеПечати.Номер;
		ОбластьМакета.Параметры.Пункт0_3 = ДокОснНомер;
		//ASP КАВ конец
	// Альтер ЛОГО+:	добавляем заполнение полей


	
	СтруктураПоиска = Новый Структура("ПорядковыйНомер", ДанныеПечати.ПорядковыйНомер);
	
	ИменаТоваров = "";
	Пока ДанныеСсылкиДокументов.НайтиСледующий(СтруктураПоиска) Цикл
		ИменаТоваров = ИменаТоваров + ДанныеСсылкиДокументов.НаименованиеВидаНоменклатуры + ", ";
	КонецЦикла;			
	
	Если СтрДлина(ИменаТоваров) >= 2 Тогда
		ИменаТоваров = Лев(ИменаТоваров, СтрДлина(ИменаТоваров) - 2);
	КонецЕсли;
	
	РеквизитыМакета.Вставить("Пункт3_1", ИменаТоваров);
	
	//ASP+
			КолМ = 0;
			СумМ = 0;
			тзНом = Новый ТаблицаЗначений;
			тзНом.Колонки.Добавить("Группа");
			Попытка
				Для Каждого стрД Из ДанныеПечати.Ссылка.ДокументыОснования Цикл
					Для Каждого стрТ Из стрД.ДокументОснование.Товары Цикл
						Если стрТ.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Товар Тогда
							КолМ = КолМ + стрТ.Количество;
							СумМ = СумМ + стрТ.Сумма;
							стрНов = тзНом.Добавить();
							стрНов.Группа = ПолучитьВерхнююГруппуНоменклатуры(стрТ.Номенклатура.Родитель);
						КонецЕсли;
					КонецЦикла;
				КонецЦикла;
			Исключение КонецПопытки;
			тзНом.Свернуть("Группа");
			Наименования = НаименованиеГрузов(тзНом.ВыгрузитьКолонку("Группа"));
			
			Текст = "";
			Попытка
				Если ТипЗнч(ДокОсн)= Тип("ДокументСсылка.ПеремещениеТоваров") тогда
					Текст = "Накладная перемещения №";
				Иначе
					Текст = "";
				КонецЕсли;
			Исключение КонецПопытки;
			
			Попытка
				СчетаФактуры = Документы.СчетФактураВыданный.СчетаФактурыПоОснованию(ДокОсн,,,Истина);
				ЕстьСчетаФактуры = СчетаФактуры.Количество() > 0;
			Исключение
				ЕстьСчетаФактуры = Ложь;
			КонецПопытки;
			СФ_Номер = "";
			Если ЕстьСчетаФактуры Тогда
				СФ_Номер = СчетаФактуры[0].Номер;
				СФ_Номер = ?(Лев(СФ_Номер, 3) = "ГТ-", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(СФ_Номер, Истина, Истина), СФ_Номер);
				СФ_Дата =СчетаФактуры[0].Дата;
			КонецЕсли;
			
			Если ТипЗнч(ДокОсн)= Тип("ДокументСсылка.ПеремещениеТоваров") тогда
			Текст = Текст + ?(ПустаяСтрока(ДокОснНомер), "", ДокОснНомер+" от "+Формат(ДокОснДата, "ДЛФ=D"))+
				?(ПустаяСтрока(СФ_Номер), "", ", счет-фактура №"+СФ_Номер+" от "+Формат(СФ_Дата, "ДЛФ=D"));
			Иначе
			Текст = Текст + ?(ПустаяСтрока(СФ_Номер), "", "УПД №"+СФ_Номер+" от "+Формат(СФ_Дата, "ДЛФ=D"));
			КонецЕсли;
			
			
			РеквизитыМакета.Вставить("Пункт3_1", Наименования);
			
			РеквизитыМакета.Вставить("Пункт3_2", Формат(Окр(КолМ,2), "ЧН=0")+" погрузочных мест");
			РеквизитыМакета.Вставить("Пункт3_3", Формат(Окр(ДанныеПечати.МассаБрутто,2), "ЧН=0")+" кг.");
			
			РеквизитыМакета.Вставить("Пункт4_1", Текст);
			
			ВалютаРегламентированогоУчета	= Константы.ВалютаРегламентированногоУчета.Получить();
			
			Если ВалютаРегламентированогоУчета <> ДанныеПечати.Валюта Тогда
			СумМ = РаботаСКурсамиВалют.ПересчитатьВВалюту(СумМ, ДанныеПечати.Валюта, ВалютаРегламентированогоУчета, ДанныеПечати.ДатаОснования);
			КонецЕсли;
			РеквизитыМакета.Вставить("Пункт3_5", Формат(Окр(СумМ,2), "ЧДЦ=2; ЧН=0,00")+" ("+РаботаСКурсамиВалют.СформироватьСуммуПрописью(СумМ, ВалютаРегламентированогоУчета)+")");			
	//ASP+
		
	Если ЗначениеЗаполнено(ДанныеПечати.Перевозчик) Тогда 
		Если СведенияОПеревозчике.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
		 Или СведенияОПеревозчике.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
			ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
				"ПолноеНаименование,ФактическийАдрес,Телефоны");
			РеквизитыМакета.Вставить("Пункт6_1", ПредставлениеПеревозчика);
		Иначе
			ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
				"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
			РеквизитыМакета.Вставить("Пункт6_1", ПредставлениеПеревозчика);
		КонецЕсли;
		ПредставлениеПеревозчика12_6 = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование,ИНН,ЮридическийАдрес");
	КонецЕсли;
	
	ГрузоподъемностьВТоннахАвтомобиля      = Формат(ДанныеПечати.ГрузоподъемностьВТоннахАвтомобиля,"");
	ВместимостьВКубическихМетрахАвтомобиля = Формат(ДанныеПечати.ВместимостьВКубическихМетрахАвтомобиля,"");
	
	ИнформацияОбАвтомобиле = ""
		+ ?(ПустаяСтрока(ДанныеПечати.ТипАвтомобиля),"",Строка(ДанныеПечати.ТипАвтомобиля) + ", ")
		+ ?(ПустаяСтрока(ДанныеПечати.МаркаАвтомобиля),"",ДанныеПечати.МаркаАвтомобиля  + ", ")
		+ ?(ПустаяСтрока(ГрузоподъемностьВТоннахАвтомобиля),"",ГрузоподъемностьВТоннахАвтомобиля + " " + НСтр("ru = 'т'", Метаданные.Языки.Русский.КодЯзыка)  + ", ")
		+ ?(ПустаяСтрока(ВместимостьВКубическихМетрахАвтомобиля),"",ВместимостьВКубическихМетрахАвтомобиля + " " + НСтр("ru = 'куб. м'", Метаданные.Языки.Русский.КодЯзыка));
	
	ИнформацияОбАвтомобиле = СокрЛП(ИнформацияОбАвтомобиле);
	
	Пока Прав(ИнформацияОбАвтомобиле,1) = "," Цикл
		ИнформацияОбАвтомобиле = Лев(ИнформацияОбАвтомобиле, СтрДлина(ИнформацияОбАвтомобиле)-1)
	КонецЦикла;
	
	РеквизитыМакета.Вставить("Пункт7_1", ИнформацияОбАвтомобиле);
	РеквизитыМакета.Вставить("Пункт7_2", ДанныеПечати.ГосНомерАвтомобиля);

	ОбластьМакета.Параметры.Заполнить(РеквизитыМакета);
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	РеквизитыМакета.Очистить();
	
	//ГТС переносим заполнение перевозчика для нового пункта 8_0
	  Если ЗначениеЗаполнено(ДанныеПечати.Перевозчик) Тогда 
			Если СведенияОПеревозчике.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо
			 Или СведенияОПеревозчике.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ИндивидуальныйПредприниматель Тогда
				ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
					"ПолноеНаименование,ФактическийАдрес,Телефоны");
				Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
				РеквизитыМакета.Вставить("Пункт8_0", ПредставлениеПеревозчика);
			Иначе
				ПредставлениеПеревозчика = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, 
					"ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны");
				Перевозчик = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПеревозчике, "ПолноеНаименование");
				РеквизитыМакета.Вставить("Пункт8_0", ПредставлениеПеревозчика);
			КонецЕсли;
		КонецЕсли;
	//
	
	
	РеквизитыМакета.Вставить("Пункт8_1", ПредставлениеГрузоотправителя);
	РеквизитыМакета.Вставить("Пункт8_2", ДанныеПечати.ПунктПогрузки);

	МассаБруттоСтрока = НСтр("ru = '%МассаБрутто% кг'", Метаданные.Языки.Русский.КодЯзыка);
	МассаБруттоСтрока = СтрЗаменить(МассаБруттоСтрока, "%МассаБрутто%", ДанныеПечати.МассаБрутто);
	РеквизитыМакета.Вставить("Пункт8_5", МассаБруттоСтрока);

	ПредставлениеВодителя = ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДанныеПечати.Водитель, ДанныеПечати.Дата);
	РеквизитыМакета.Вставить("Пункт8_8", ПредставлениеВодителя);

	
	РеквизитыМакета.Вставить("Пункт10_1", ДанныеПечати.ПунктРазгрузки);
	РеквизитыМакета.Вставить("Пункт10_6", МассаБруттоСтрока);
	РеквизитыМакета.Вставить("Пункт10_9", ПредставлениеВодителя);
	
	СведенияОПлательщике = ФормированиеПечатныхФорм.СведенияОЮрФизЛице(ДанныеПечати.Плательщик, ДанныеПечати.Дата,,ДанныеПечати.БанковскийСчетПлательщика);

	РеквизитыМакета.Вставить("Пункт12_10", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПлательщике, 
		"ПолноеНаименование,ИНН,ЮридическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет"));
	
	//ГТС 26.02.2022 Выводим более полные данные
	//РеквизитыМакета.Вставить("Пункт12_7", Грузоотправитель);
	РеквизитыМакета.Вставить("Пункт12_7", ПредставлениеГрузоотправителя);
	
	РеквизитыМакета.Вставить("Пункт12_6", ПредставлениеПеревозчика12_6);
	РеквизитыМакета.Вставить("Пункт12_12", ДанныеПечати.Кладовщик);
	
	РеквизитыМакета.Вставить("Пункт12_13", Формат(ДанныеПечати.Дата, "ДЛФ=D"));
	МассивСтрок = Новый Массив;
	Если Не ПустаяСтрока(ДанныеПечати.ДолжностьКладовщика) Тогда
		МассивСтрок.Добавить(ДанныеПечати.ДолжностьКладовщика);
	КонецЕсли;
	МассивСтрок.Добавить(Формат(ДанныеПечати.Дата, "ДЛФ=D"));
	РеквизитыМакета.Вставить("Пункт12_14", СтрСоединить(МассивСтрок, ", "));
	
	
	//ASP +
		РеквизитыМакета.Вставить("Пункт8_3", Формат(ДокОснДата, "ДЛФ=D"));
		РеквизитыМакета.Вставить("Пункт8_4", Формат(ДокОснДата, "ДЛФ=D"));
		РеквизитыМакета.Вставить("Пункт8_41", Формат(ДокОснДата, "ДЛФ=D"));
		РеквизитыМакета.Вставить("Пункт8_51", Формат(Окр(КолМ,2), "ЧН=0"));
		РеквизитыМакета.Вставить("Пункт8_5",  Формат(Окр(ДанныеПечати.МассаБрутто,2), "ЧН=0")+" кг.");
		РеквизитыМакета.Вставить("Пункт8_7",  ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(ДокОсн[РеквизитОтветственный].ФизическоеЛицо));
		РеквизитыМакета.Вставить("Пункт10_2", Формат(ДокОснДата, "ДЛФ=D"));
		РеквизитыМакета.Вставить("Пункт10_3", Формат(ДокОснДата, "ДЛФ=D"));
		РеквизитыМакета.Вставить("Пункт10_31", Формат(ДокОснДата, "ДЛФ=D"));
		РеквизитыМакета.Вставить("Пункт10_5", Формат(Окр(КолМ,2), "ЧН=0"));
		РеквизитыМакета.Вставить("Пункт10_6",  Формат(Окр(ДанныеПечати.МассаБрутто,2), "ЧН=0")+" кг.");
	//ASP -
	
	ОбластьМакетаОборотная.Параметры.Заполнить(РеквизитыМакета);
	
	ТабличныйДокумент.Вывести(ОбластьМакетаОборотная);
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеПечати.Ссылка);
	
	// Альтер ЛОГО+:	подправим область печати
		ТабличныйДокумент.ПолеСправа = 5;
		ТабличныйДокумент.ПолеСлева = 5;
		ТабличныйДокумент.ПолеСверху = 6;
		ТабличныйДокумент.ПолеСнизу = 5;
		ТабличныйДокумент.Автомасштаб = Истина;
	// +Альтер ЛОГО
КонецПроцедуры
//{{MRG[ <-> ]
//			ЗаполнитьТабличныйДокументТНВерсияС2022(ТабличныйДокумент, ОбъектыПечати, ДанныеСсылкиДокументов, ДанныеПечати, Макет2200_1);
//}}MRG[ <-> ]

Функция ДействуетПостановлениеНомер2200(ДатаДокумента)
	
	НачалоПрименения = '20210101';
	
	Если ДатаДокумента < НачалоПрименения Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ASP_Доработки


Функция РеквизитОтветственного(Ссылка)
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации") тогда
		возврат "Менеджер";
	Иначе
		возврат "Ответственный";
	Конецесли;
	
КонецФункции

Функция ПолучитьВерхнююГруппуНоменклатуры(Знач Группа)
	
	Пока истина цикл		
		Если Группа.Родитель = Справочники.Номенклатура.ПустаяСсылка() тогда
			возврат Группа;
		КонецЕсли;
		//
		Группа = Группа.Родитель;
	Конеццикла;
	
КонецФункции

Функция НаименованиеГрузов(Массив)
	
	Текст = "";
	Для каждого е из Массив цикл
		Текст = Текст + е.Наименование + ", ";
	Конеццикла;
	
	возврат Текст;
	
КонецФункции

Функция ДействуетПостановление2200(ДатаДокумента)
	
	НачалоПрименения = '20210101';
	
	Если ДатаДокумента < НачалоПрименения Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции


#КонецОбласти
